# Lecture 2 SQL Basics

In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Collecting sqlparse
  Downloading sqlparse-0.4.3-py3-none-any.whl (42 kB)
     |████████████████████████████████| 42 kB 4.0 MB/s  eta 0:00:01
Requirement already satisfied: ipython>=1.0 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: six in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: jedi>=0.16 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: traitlets>=4.2 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: backcall in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: matplotlib-inline in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: pexpect>4.3 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: pygments in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: setuptools>=18.5 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: decorator in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: appnope in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: ptyprocess>=0.5 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in /Users/davidbianchin/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py) ... done
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13714 sha256=6a681c0dc66befcc7dc2c22b58d4e24a8065aa6747b7147ded02c9b69c654f95
  Stored in directory: /Users/davidbianchin/Library/Caches/pip/wheels/75/f7/28/77a076f1fa8cbeda61aca712815d04d7a32435f04a26a2dd7b
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlparse-0.4.3

In [2]:
%load_ext sql
#% is python magic command

In [3]:
%sql sqlite://
#sql is not case-sensitive

In [4]:
### CHAR() is size limit
### SEMICOLON INDICATES END OF COMMAND
### Adding comments are not good in the cells below

# How to Create Table

In [5]:
%%sql CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15),
FIRST_NAME CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2) 
);

 * sqlite://
Done.

[]

# How to modify existing table

In [6]:
%sql DROP TABLE rep;

 * sqlite://
Done.

[]

In [7]:
%%sql CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15) NOT NULL,
FIRST_NAME CHAR(15) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2) 
);

 * sqlite://
Done.

[]

# Pulling/ Displaying a Table

In [8]:
%sql SELECT * FROM REP;

 * sqlite://
Done.

[]

In [9]:
%%sql
INSERT INTO rep
VALUES
('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.50, 0.05)

 * sqlite://
1 rows affected.

[]

In [10]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05)]

In [11]:
# ; seperates commands

# Inserting a row that contains null values

In [12]:
%sql INSERT INTO rep (REP_NUM, LAST_NAME, FIRST_NAME) VALUES ('85', 'Webb', 'Tina');

 * sqlite://
1 rows affected.

[]

In [13]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('85', 'Webb', 'Tina', None, None, None, None, None, None)]

In [14]:
%%sql
INSERT INTO rep
VALUES
('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05);

 * sqlite://
2 rows affected.

[]

# Update Records

In [15]:
%%sql 
UPDATE rep
SET last_name = 'Perry'
WHERE rep_num = '85';

 * sqlite://
1 rows affected.

[]

In [16]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('85', 'Perry', 'Tina', None, None, None, None, None, None),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05)]

# Deleting Records

In [17]:
%sql DELETE FROM rep WHERE rep_num = '85'

 * sqlite://
1 rows affected.

[]

In [18]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05)]

# Creating The Remaining Database

In [19]:
%%sql
CREATE TABLE CUSTOMER
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2),
REP_NUM CHAR(2) );

 * sqlite://
Done.

[]

In [20]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837
Greenway','Fillmore','FL','33336',6550.00,7500.00,'20'),
('282','Brookings Direct','3827
Devon','Grove','FL','33321',431.50,10000.00,'35'),
('356','Ferguson''s','382
Wildwood','Northfield','FL','33146',5785.00,7500.00,'65'),
('408','The Everything Shop','1828
Raven','Crystal','FL','33503',5285.25,5000.00,'35'),
('462','Bargains Galore','3829
Central','Grove','FL','33321',3412.00,10000.00,'65'),
('524','Kline''s','838
Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20'),
('608','Johnson''s Department Store','372
Oxford','Sheldon','FL','33553',2106.00,10000.00,'65'),
('687','Lee''s Sport and Appliance','282
Evergreen','Altonville','FL','32543',2851.00,5000.00,'35'),
('725','Deerfield''s Four Seasons','282
Columbia','Sheldon','FL','33553',248.00,7500.00,'35'),
('842','All Season','28
Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
10 rows affected.

[]

In [21]:
%sql SELECT * FROM CUSTOMER

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '2837\nGreenway', 'Fillmore', 'FL', '33336', 6550, 7500, '20'),
 ('282', 'Brookings Direct', '3827\nDevon', 'Grove', 'FL', '33321', 431.5, 10000, '35'),
 ('356', "Ferguson's", '382\nWildwood', 'Northfield', 'FL', '33146', 5785, 7500, '65'),
 ('408', 'The Everything Shop', '1828\nRaven', 'Crystal', 'FL', '33503', 5285.25, 5000, '35'),
 ('462', 'Bargains Galore', '3829\nCentral', 'Grove', 'FL', '33321', 3412, 10000, '65'),
 ('524', "Kline's", '838\nRidgeland', 'Fillmore', 'FL', '33336', 12762, 15000, '20'),
 ('608', "Johnson's Department Store", '372\nOxford', 'Sheldon', 'FL', '33553', 2106, 10000, '65'),
 ('687', "Lee's Sport and Appliance", '282\nEvergreen', 'Altonville', 'FL', '32543', 2851, 5000, '35'),
 ('725', "Deerfield's Four Seasons", '282\nColumbia', 'Sheldon', 'FL', '33553', 248, 7500, '35'),
 ('842', 'All Season', '28\nLakeview', 'Grove', 'FL', '33321', 8221, 7500, '20')]

In [22]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3) );

 * sqlite://
Done.

[]

In [23]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20
OCT 2010','148'),
('21610','20
OCT 2010','356'),
('21613','21
OCT 2010','408'),
('21614','21
OCT 2010','282'),
('21617','23
OCT 2010','608'),
('21619','23
OCT 2010','148'),
('21623','23
OCT 2010','608');

 * sqlite://
7 rows affected.

[]

In [24]:
%sql SELECT * FROM ORDERS

 * sqlite://
Done.

[('21608', '20\nOCT 2010', '148'),
 ('21610', '20\nOCT 2010', '356'),
 ('21613', '21\nOCT 2010', '408'),
 ('21614', '21\nOCT 2010', '282'),
 ('21617', '23\nOCT 2010', '608'),
 ('21619', '23\nOCT 2010', '148'),
 ('21623', '23\nOCT 2010', '608')]

In [25]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
Done.

[]

In [26]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave
Oven',32,'AP','1',165.00),
('DL71','Cordless
Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
10 rows affected.

[]

In [27]:
%sql SELECT * FROM PART

 * sqlite://
Done.

[('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('CD52', 'Microwave\nOven', 32, 'AP', '1', 165),
 ('DL71', 'Cordless\nDrill', 21, 'HW', '3', 129.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390)]

In [28]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
Done.

[]

In [29]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
9 rows affected.

[]

In [30]:
%sql SELECT * FROM ORDER_LINE

 * sqlite://
Done.

[('21608', 'AT94', 11, 21.95),
 ('21610', 'DR93', 1, 495),
 ('21610', 'DW11', 1, 399.99),
 ('21613', 'KL62', 4, 329.95),
 ('21614', 'KT03', 2, 595),
 ('21617', 'BV06', 2, 794.95),
 ('21617', 'CD52', 4, 150),
 ('21619', 'DR93', 1, 495),
 ('21623', 'KV29', 2, 1290)]

#

# 3. SQL FUNDAMENTALS LECTURE

# Retrieving Certain Columns and Rows

In [31]:
%sql SELECT CUSTOMER_NUM, CUSTOMER_NAME, BALANCE FROM CUSTOMER;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", 6550),
 ('282', 'Brookings Direct', 431.5),
 ('356', "Ferguson's", 5785),
 ('408', 'The Everything Shop', 5285.25),
 ('462', 'Bargains Galore', 3412),
 ('524', "Kline's", 12762),
 ('608', "Johnson's Department Store", 2106),
 ('687', "Lee's Sport and Appliance", 2851),
 ('725', "Deerfield's Four Seasons", 248),
 ('842', 'All Season', 8221)]

# Using a WHERE Clause

In [32]:
%%sql SELECT CUSTOMER_NAME
FROM CUSTOMER
WHERE CUSTOMER_NUM = '148';

 * sqlite://
Done.

[("Al's Appliance and Sport",)]

In [33]:
%%sql
SELECT customer_num, customer_name, balance, credit_limit
FROM customer
WHERE balance > credit_limit;

 * sqlite://
Done.

[('408', 'The Everything Shop', 5285.25, 5000),
 ('842', 'All Season', 8221, 7500)]

In [34]:
# %%sql
# SELECT customer_num, customer_name, balance, credit_limit -> WHAT COLUMNS DO YOU WANT
# FROM customer -> WHAT TABLE DO YOU WANT IT FROM
# WHERE balance > credit_limit;

# Using Compound Conditions

In [35]:
%%sql SELECT description
FROM part
WHERE warehouse = '3'
AND ON_HAND > 25;

 * sqlite://
Done.

[('Iron',)]

In [36]:
%%sql SELECT description
FROM part
WHERE NOT warehouse = '3';

 * sqlite://
Done.

[('Home Gym',),
 ('Microwave\nOven',),
 ('Gas Range',),
 ('Dryer',),
 ('Treadmill',)]

# Using Between Operator

In [37]:
%%sql SELECT customer_num, customer_name, balance
FROM customer
WHERE balance BETWEEN 2000 AND 5000;

 * sqlite://
Done.

[('462', 'Bargains Galore', 3412),
 ('608', "Johnson's Department Store", 2106),
 ('687', "Lee's Sport and Appliance", 2851)]

# Using Computed Columns

In [38]:
%%sql SELECT customer_num, customer_name, (credit_limit - balance)
FROM customer;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", 950),
 ('282', 'Brookings Direct', 9568.5),
 ('356', "Ferguson's", 1715),
 ('408', 'The Everything Shop', -285.25),
 ('462', 'Bargains Galore', 6588),
 ('524', "Kline's", 2238),
 ('608', "Johnson's Department Store", 7894),
 ('687', "Lee's Sport and Appliance", 2149),
 ('725', "Deerfield's Four Seasons", 7252),
 ('842', 'All Season', -721)]

In [39]:
%%sql SELECT customer_num, customer_name, (credit_limit - balance) AS available_credit
FROM customer;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", 950),
 ('282', 'Brookings Direct', 9568.5),
 ('356', "Ferguson's", 1715),
 ('408', 'The Everything Shop', -285.25),
 ('462', 'Bargains Galore', 6588),
 ('524', "Kline's", 2238),
 ('608', "Johnson's Department Store", 7894),
 ('687', "Lee's Sport and Appliance", 2149),
 ('725', "Deerfield's Four Seasons", 7252),
 ('842', 'All Season', -721)]

# Using the LIKE operator

In [40]:
%%sql SELECT customer_num, customer_name, street, city, state, ZIP
FROM customer
WHERE street LIKE '%Central%';

 * sqlite://
Done.

[('462', 'Bargains Galore', '3829\nCentral', 'Grove', 'FL', '33321')]

# Using the IN Operator

In [41]:
%%sql SELECT customer_num, customer_name, credit_limit
FROM customer
WHERE CREDIT_LIMIT IN (5000, 10000, 15000);

 * sqlite://
Done.

[('282', 'Brookings Direct', 10000),
 ('408', 'The Everything Shop', 5000),
 ('462', 'Bargains Galore', 10000),
 ('524', "Kline's", 15000),
 ('608', "Johnson's Department Store", 10000),
 ('687', "Lee's Sport and Appliance", 5000)]

# Sorting

In [42]:
%%sql SELECT customer_num, customer_name, credit_limit
FROM customer
ORDER BY credit_limit DESC, customer_name;

 * sqlite://
Done.

[('524', "Kline's", 15000),
 ('462', 'Bargains Galore', 10000),
 ('282', 'Brookings Direct', 10000),
 ('608', "Johnson's Department Store", 10000),
 ('148', "Al's Appliance and Sport", 7500),
 ('842', 'All Season', 7500),
 ('725', "Deerfield's Four Seasons", 7500),
 ('356', "Ferguson's", 7500),
 ('687', "Lee's Sport and Appliance", 5000),
 ('408', 'The Everything Shop', 5000)]

# Using Functions

In [43]:
# Aggregate Functions apply to groups of rows

In [44]:
# Count

In [45]:
%%sql SELECT COUNT(*)
FROM part
WHERE class = 'HW';

 * sqlite://
Done.

[(3,)]

In [46]:
# Sum, Avg, Max, Min

In [47]:
%%sql SELECT SUM(balance), AVG(balance), MAX(balance), MIN(balance)
FROM customer;

 * sqlite://
Done.

[(47651.75, 4765.175, 12762, 248)]

# Using the DISTINCT operator

In [48]:
%sql SELECT customer_num FROM orders;

 * sqlite://
Done.

[('148',), ('356',), ('408',), ('282',), ('608',), ('148',), ('608',)]

In [49]:
%sql SELECT DISTINCT(customer_num) FROM orders;

 * sqlite://
Done.

[('148',), ('356',), ('408',), ('282',), ('608',)]

# Nesting Queries

In [50]:
%%sql
SELECT part_num
FROM part
WHERE CLASS = 'AP';

 * sqlite://
Done.

[('CD52',), ('DR93',), ('DW11',), ('KL62',), ('KT03',)]

In [51]:
%%sql
SELECT ORDER_NUM 
FROM order_line
WHERE part_num IN
(SELECT part_num
FROM part
WHERE CLASS = 'AP');

 * sqlite://
Done.

[('21610',), ('21610',), ('21613',), ('21614',), ('21617',), ('21619',)]

In [52]:
%%sql
SELECT customer_num, customer_name, balance
FROM customer
WHERE balance >
(SELECT AVG(balance)
 FROM customer);

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", 6550),
 ('356', "Ferguson's", 5785),
 ('408', 'The Everything Shop', 5285.25),
 ('524', "Kline's", 12762),
 ('842', 'All Season', 8221)]

# Grouping

In [53]:
%%sql
SELECT rep_num, AVG(balance)
FROM customer
GROUP BY rep_num
ORDER BY rep_num;

 * sqlite://
Done.

[('20', 9177.666666666666), ('35', 2203.9375), ('65', 3767.6666666666665)]

# Using a HAVING Clause

In [54]:
%%sql
SELECT rep_num, AVG(balance)
FROM customer
GROUP BY rep_num
HAVING COUNT(*) < 4
ORDER BY REP_NUM;

 * sqlite://
Done.

[('20', 9177.666666666666), ('65', 3767.6666666666665)]

In [55]:
%%sql
SELECT CREDIT_LIMIT, COUNT(*)
FROM CUSTOMER
WHERE REP_NUM = '20'
GROUP BY CREDIT_LIMIT
HAVING COUNT(*) > 1
ORDER BY CREDIT_LIMIT;

 * sqlite://
Done.

[(7500, 2)]

# Nulls

In [56]:
%%sql
SELECT customer_num, customer_name
FROM customer
WHERE street IS NULL

 * sqlite://
Done.

[]

#

# 4. SQL ADVANCED LECTURE

# Joining Two Tables

In [57]:
%%sql

SELECT CUSTOMER_NUM, CUSTOMER_NAME, REP.REP_NUM, LAST_NAME, FIRST_NAME
FROM CUSTOMER, REP
WHERE CUSTOMER.REP_NUM = REP.REP_NUM
AND CREDIT_LIMIT = 7500;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '20', 'Kaiser', 'Valerie'),
 ('356', "Ferguson's", '65', 'Perez', 'Juan'),
 ('725', "Deerfield's Four Seasons", '35', 'Hull', 'Richard'),
 ('842', 'All Season', '20', 'Kaiser', 'Valerie')]

##### REP.REP_NUM clarifies which table to pull that column from (both tables have this colum)

In [58]:
%%sql
SELECT ORDER_NUM, ORDER_LINE.PART_NUM, DESCRIPTION, NUM_ORDERED, QUOTED_PRICE, PRICE
FROM ORDER_LINE, PART
WHERE ORDER_LINE.PART_NUM = PART.PART_NUM;

 * sqlite://
Done.

[('21608', 'AT94', 'Iron', 11, 21.95, 24.95),
 ('21610', 'DR93', 'Gas Range', 1, 495, 495),
 ('21610', 'DW11', 'Washer', 1, 399.99, 399.99),
 ('21613', 'KL62', 'Dryer', 4, 329.95, 349.95),
 ('21614', 'KT03', 'Dishwasher', 2, 595, 595),
 ('21617', 'BV06', 'Home Gym', 2, 794.95, 794.95),
 ('21617', 'CD52', 'Microwave\nOven', 4, 150, 165),
 ('21619', 'DR93', 'Gas Range', 1, 495, 495),
 ('21623', 'KV29', 'Treadmill', 2, 1290, 1390)]

# Comparing Joins, IN and Exists

In [59]:
%%sql
SELECT description
FROM order_line, part
WHERE order_line.part_num = part.part_num
AND order_num = '21610';

 * sqlite://
Done.

[('Gas Range',), ('Washer',)]

In [60]:
%%sql
SELECT description
FROM part
WHERE part_num IN
(SELECT part_num
FROM order_line
WHERE order_num = '21610');

 * sqlite://
Done.

[('Gas Range',), ('Washer',)]

In [61]:
%%sql
SELECT order_num, order_date
FROM orders
WHERE exists
(SELECT *
FROM ORDER_LINE
WHERE ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
AND PART_NUM = 'DR93');

 * sqlite://
Done.

[('21610', '20\nOCT 2010'), ('21619', '23\nOCT 2010')]

# Using a Subquery within a Subquery

In [62]:
%%sql
SELECT order_num, order_date
FROM orders
WHERE order_num IN
(SELECT order_num FROM order_line
 WHERE part_num IN
(SELECT part_num
FROM part
WHERE warehouse = '3'));

 * sqlite://
Done.

[('21608', '20\nOCT 2010'),
 ('21610', '20\nOCT 2010'),
 ('21614', '21\nOCT 2010')]

In [63]:
%%sql
SELECT customer_num, orders.order_num, order_date,
SUM(num_ordered * quoted_price) AS order_total
FROM orders, order_line
WHERE orders.order_num = order_line.order_num
GROUP BY orders.order_num, customer_num, order_date
HAVING SUM(num_ordered * quoted_price) > 1000
ORDER BY orders.order_num;

 * sqlite://
Done.

[('408', '21613', '21\nOCT 2010', 1319.8),
 ('282', '21614', '21\nOCT 2010', 1190),
 ('608', '21617', '23\nOCT 2010', 2189.9),
 ('608', '21623', '23\nOCT 2010', 2580)]

# Using an Alias

In [64]:
%%sql
SELECT r.rep_num, last_name, first_name, c.customer_num, customer_name
FROM rep r, customer c
WHERE r.rep_num = c.rep_num;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '148', "Al's Appliance and Sport"),
 ('35', 'Hull', 'Richard', '282', 'Brookings Direct'),
 ('65', 'Perez', 'Juan', '356', "Ferguson's"),
 ('35', 'Hull', 'Richard', '408', 'The Everything Shop'),
 ('65', 'Perez', 'Juan', '462', 'Bargains Galore'),
 ('20', 'Kaiser', 'Valerie', '524', "Kline's"),
 ('65', 'Perez', 'Juan', '608', "Johnson's Department Store"),
 ('35', 'Hull', 'Richard', '687', "Lee's Sport and Appliance"),
 ('35', 'Hull', 'Richard', '725', "Deerfield's Four Seasons"),
 ('20', 'Kaiser', 'Valerie', '842', 'All Season')]

# Joining a Table to Itself

In [65]:
%%sql
SELECT f.customer_num, f.customer_name, s.customer_num, s.customer_name,
f.city
FROM customer F, customer S
WHERE f.city = s.city
AND f.customer_num < s.customer_num
ORDER BY f.customer_num, s.customer_num;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '524', "Kline's", 'Fillmore'),
 ('282', 'Brookings Direct', '462', 'Bargains Galore', 'Grove'),
 ('282', 'Brookings Direct', '842', 'All Season', 'Grove'),
 ('462', 'Bargains Galore', '842', 'All Season', 'Grove'),
 ('608', "Johnson's Department Store", '725', "Deerfield's Four Seasons", 'Sheldon')]

# Joining Several Tables

In [66]:
%%sql
SELECT part_num, num_ordered, order_line.order_num, order_date,
customer.customer_num, customer_name, last_name
FROM order_line, orders, customer, rep
WHERE orders.order_num = order_line.order_num
AND customer.customer_num = orders.customer_num
AND rep.rep_num = customer.rep_num;

 * sqlite://
Done.

[('AT94', 11, '21608', '20\nOCT 2010', '148', "Al's Appliance and Sport", 'Kaiser'),
 ('DR93', 1, '21610', '20\nOCT 2010', '356', "Ferguson's", 'Perez'),
 ('DW11', 1, '21610', '20\nOCT 2010', '356', "Ferguson's", 'Perez'),
 ('KL62', 4, '21613', '21\nOCT 2010', '408', 'The Everything Shop', 'Hull'),
 ('KT03', 2, '21614', '21\nOCT 2010', '282', 'Brookings Direct', 'Hull'),
 ('BV06', 2, '21617', '23\nOCT 2010', '608', "Johnson's Department Store", 'Perez'),
 ('CD52', 4, '21617', '23\nOCT 2010', '608', "Johnson's Department Store", 'Perez'),
 ('DR93', 1, '21619', '23\nOCT 2010', '148', "Al's Appliance and Sport", 'Kaiser'),
 ('KV29', 2, '21623', '23\nOCT 2010', '608', "Johnson's Department Store", 'Perez')]

# Set Operations

In [76]:
# Union

In [77]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE REP_NUM = '65'
UNION
SELECT CUSTOMER.CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = orders.customer_num;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"),
 ('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('608', "Johnson's Department Store")]

In [78]:
# Intersection

In [79]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE REP_NUM = '65'
INTERSECT
SELECT CUSTOMER.CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = orders.customer_num;

 * sqlite://
Done.

[('356', "Ferguson's"), ('608', "Johnson's Department Store")]

In [80]:
# Difference - MINUS/EXCEPT

In [86]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE REP_NUM = '65'
EXCEPT
SELECT CUSTOMER.CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = orders.customer_num;

 * sqlite://
Done.

[('462', 'Bargains Galore')]

# Inner Join

In [92]:
%%sql
SELECT customer.customer_num, customer_name, order_num, order_date
FROM customer
INNER JOIN ORDERS
ON CUSTOMER.CUSTOMER_NUM = orders.customer_num
ORDER BY customer.customer_num;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '21608', '20\nOCT 2010'),
 ('148', "Al's Appliance and Sport", '21619', '23\nOCT 2010'),
 ('282', 'Brookings Direct', '21614', '21\nOCT 2010'),
 ('356', "Ferguson's", '21610', '20\nOCT 2010'),
 ('408', 'The Everything Shop', '21613', '21\nOCT 2010'),
 ('608', "Johnson's Department Store", '21617', '23\nOCT 2010'),
 ('608', "Johnson's Department Store", '21623', '23\nOCT 2010')]